"""
Дана последовательность целых положительных чисел. Определить количество простых чисел в последовательности.
"""
#TODO: почему значение 15 добавилось?

l = [4, 5, 6, 8, 11, 13, 14, 15, 17]      # 5, 11, 13, 17
m = []
r = range(2, l[-1])

for i in l:
    #print("i: ", i)
    for j in r:
        if i % j == 0 and i > j:
            print("i: ", i, "j: ", j, " i / j: ", i / j)
            break
        else:
            m.append(i)

print(len(set(m)), set(m))
