"""
Дана последовательность целых положительных чисел. Определить количество простых чисел в последовательности.
"""
l = [4, 5, 6, 8, 11, 13, 14, 15, 17]      # 5, 11, 13, 17
m = []
r = range(2, l[-1])

for i in l:
    #print("i: ", i)
    for j in r:
        if i % j == 0 and i > j:
            print("i: ", i, "j: ", j, " i / j: ", i / j)
            m.append(i)
            j += 1

print(len(m), m)
#print(r)
